PotatoCooling/Linux Files/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }

application     chtMultiRegionFoam;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         600;

deltaT          0.01;

writeControl    adjustableRunTime;
writeInterval   10;
purgeWrite      0;

adjustTimeStep  yes;
maxCo           2.0;
maxDeltaT       5.0;

writeFormat     ascii;
writePrecision  8;
runTimeModifiable true;

functions
{
    probes_solid
    {
        type            probes;
        libs            ("libsampling.so");
        region          potato;
        writeControl    timeStep;
        writeInterval   10;
        fields          (T);
        probeLocations
        (
            (0      0      0)       // potato centre
            (0.038  0      0)       // potato surface (equator, just inside)
            (0      0      0.038)   // potato surface (top, just inside)
        );
    }
    probes_fluid
    {
        type            probes;
        libs            ("libsampling.so");
        region          domain0;
        writeControl    timeStep;
        writeInterval   10;
        fields          (T);
        probeLocations
        (
            (0      0      0.060)   // air 20mm above top
            (0      0      0.150)   // air plume 110mm above
        );
    }
}
