PotatoCooling/Linux Files/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }

// Background box for snappyHexMesh
// 400 x 400 x 600 mm, origin centred on potato
// Gravity in -z direction; potato at z=0, plume rises in +z

scale 1;

vertices
(
    (-0.20 -0.20 -0.20)   // 0
    ( 0.20 -0.20 -0.20)   // 1
    ( 0.20  0.20 -0.20)   // 2
    (-0.20  0.20 -0.20)   // 3
    (-0.20 -0.20  0.40)   // 4
    ( 0.20 -0.20  0.40)   // 5
    ( 0.20  0.20  0.40)   // 6
    (-0.20  0.20  0.40)   // 7
);

blocks
(
    // 20 cells each side → 40mm base cells; snappy refines near sphere
    hex (0 1 2 3 4 5 6 7) (10 10 15) simpleGrading (1 1 1)
);

boundary
(
    sides
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);
