PotatoCooling/Linux Files/constant/potato/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/potato/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    potato_to_domain0
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          4872;
        startFace       49332;
        sampleMode      nearestPatchFace;
        sampleRegion    domain0;
        samplePatch     domain0_to_potato;
    }
)

// ************************************************************************* //
