PotatoCooling/Linux Files/constant/domain0/turbulenceProperties
FoamFile { version 2.0; format ascii; class dictionary; object turbulenceProperties; }
simulationType laminar;
