PotatoCooling/Linux Files/constant/domain0/thermophysicalProperties
FoamFile { version 2.0; format ascii; class dictionary; object thermophysicalProperties; }
thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}
mixture
{
    specie          { molWeight 28.97; }
    thermodynamics  { Cp 1007; Hf 0; }
    transport       { mu 1.85e-5; Pr 0.713; }
}
