PotatoCooling/Linux Files/constant/potato/radiationProperties
FoamFile { version 2.0; format ascii; class dictionary; object radiationProperties; }
radiationModel  none;
