PotatoCooling/Linux Files/constant/potato/thermophysicalProperties
FoamFile { version 2.0; format ascii; class dictionary; object thermophysicalProperties; }
thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}
mixture
{
    specie          { molWeight 18; nMoles 1; }
    transport       { kappa 0.56; }
    thermodynamics  { Cp 3600; Hf 0; }
    equationOfState { rho 1050; }
}
