PotatoCooling/Linux Files/constant/regionProperties
FoamFile { version 2.0; format ascii; class dictionary; object regionProperties; }

regions
(
    fluid   (domain0)
    solid   (potato)
);
