PotatoCooling/Linux Files/0/domain0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);
boundaryField
{
    sides               { type noSlip; }
    domain0_to_potato   { type noSlip; }
}
