PotatoCooling/Linux Files/0/domain0/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 101325;
boundaryField
{
    sides               { type calculated; value uniform 101325; }
    domain0_to_potato   { type calculated; value uniform 101325; }
}
