PotatoCooling/Linux Files/0/domain0/p_rgh
FoamFile { version 2.0; format ascii; class volScalarField; object p_rgh; }
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 101325;
boundaryField
{
    sides               { type fixedFluxPressure; value uniform 101325; }
    domain0_to_potato   { type fixedFluxPressure; value uniform 101325; }
}
