PotatoCooling/Linux Files/0/potato/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 101325;
boundaryField
{
    potato_to_domain0   { type calculated; value uniform 101325; }
}
