PotatoCooling/Linux Files/0/domain0/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions      [0 0 0 1 0 0 0];
internalField   uniform 298.15;
boundaryField
{
    sides
    {
        type            fixedValue;
        value           uniform 298.15;
    }
    domain0_to_potato
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           uniform 370.0;
    }
}
